# Intro to Pandas

This is a short introduction to pandas based on the [10 Minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html) geared mainly for new users along with a few addition based on the [Cookbook](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook) recipes

Customarily, we import as follows:

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
%matplotlib inline

## Object Creation

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)

### Series
Creating a Series by passing a list of values, letting pandas create a default integer index:

In [7]:
s = pd.Series([1,3,5,np.nan, 6,8])

In [8]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Series is very similar to numpy array but the index of a series is an additional class attribute

In [9]:
s.values # values of the series - a numpy arry

array([ 1.,  3.,  5., nan,  6.,  8.])

In [10]:
s.index # index of the series

RangeIndex(start=0, stop=6, step=1)

### Dataframes

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [21]:
dates = pd.date_range('20130101', periods=6)

In [22]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[us]', freq='D')

A Dataframe has:
    - index
    - values
    - column names
    - is a generalization of an excel table

In [27]:

# df = pd.DataFrame(np.random.randn(6,4))
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [31]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [34]:
df2.F

0    foo
1    foo
2    foo
3    foo
Name: F, dtype: str

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

As you can see, the columns A, B, C, and D are automatically tab completed. E is there as well; the rest of the attributes have been truncated for brevity.

## Viewing Data

See the [Basics section](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

See the top & bottom rows of the frame

In [35]:
df.head(2)

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123

In [36]:
df.tail(2)

                   A         B         C         D
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

Display the index, columns, and the underlying numpy data

In [58]:
df.reset_index().set_index('A').sort_index()

               index         B         C         D
A
-1.735809 2013-01-05  0.104906  0.588369  1.372278
-1.551845 2013-01-02  0.286379 -0.229315  0.576123
-0.364734 2013-01-06  1.555375 -0.497573 -0.281790
-0.358542 2013-01-03 -0.355383 -0.067001  0.351484
-0.294955 2013-01-04  0.006319  0.918337 -3.084601
 0.558480 2013-01-01  0.863395  1.185102  2.349155

In [49]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='str')

In [50]:
df.values

array([[ 0.5584805 ,  0.86339475,  1.18510183,  2.34915543],
       [-1.55184504,  0.28637859, -0.22931466,  0.57612267],
       [-0.3585416 , -0.35538296, -0.06700082,  0.35148408],
       [-0.2949549 ,  0.00631885,  0.9183368 , -3.08460137],
       [-1.73580863,  0.10490626,  0.58836852,  1.37227832],
       [-0.3647345 ,  1.55537548, -0.49757346, -0.28178955]])

Describe shows a quick statistic summary of the numeric columns of the data

In [52]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.624567  0.410165  0.316320  0.213775
std    0.865012  0.689142  0.677981  1.853489
min   -1.735809 -0.355383 -0.497573 -3.084601
25%   -1.255067  0.030966 -0.188736 -0.123471
50%   -0.361638  0.195642  0.260684  0.463803
75%   -0.310852  0.719141  0.835845  1.173239
max    0.558480  1.555375  1.185102  2.349155

Transposing your data

In [53]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.558480   -1.551845   -0.358542   -0.294955   -1.735809   -0.364734
B    0.863395    0.286379   -0.355383    0.006319    0.104906    1.555375
C    1.185102   -0.229315   -0.067001    0.918337    0.588369   -0.497573
D    2.349155    0.576123    0.351484   -3.084601    1.372278   -0.281790

Sorting by an axis

In [63]:
df.reset_index().rename(columns={'index':'date'}).set_index(['date', 'A']).sort_index(axis=0, ascending=True)

                             B         C         D
date       A
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

In [64]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  2.349155  1.185102  0.863395  0.558480
2013-01-02  0.576123 -0.229315  0.286379 -1.551845
2013-01-03  0.351484 -0.067001 -0.355383 -0.358542
2013-01-04 -3.084601  0.918337  0.006319 -0.294955
2013-01-05  1.372278  0.588369  0.104906 -1.735809
2013-01-06 -0.281790 -0.497573  1.555375 -0.364734

Sorting by value

In [65]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

See the indexing documentation [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### Getting

Selecting a single column, which yields a Series, equivalent to df.A

In [66]:
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

In [72]:
df['A']

2013-01-01    0.558480
2013-01-02   -1.551845
2013-01-03   -0.358542
2013-01-04   -0.294955
2013-01-05   -1.735809
2013-01-06   -0.364734
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [79]:
df[0:3]

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484

In [75]:
df['20130101':'20130103']

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484

### Selection by Label

See more in [Selection by Label](Selection by Label)

For getting a cross section using a label

In [80]:
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

In [86]:
dates[0]

Timestamp('2013-01-01 00:00:00')

In [92]:
df.loc[dates[0]:dates[3], :]

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02 -1.551845  0.286379 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601

Selection by Label

In [94]:
df.loc[:,['A','C']]

                   A         C
2013-01-01  0.558480  1.185102
2013-01-02 -1.551845 -0.229315
2013-01-03 -0.358542 -0.067001
2013-01-04 -0.294955  0.918337
2013-01-05 -1.735809  0.588369
2013-01-06 -0.364734 -0.497573

Showing label slicing, both endpoints are included

In [95]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -1.551845  0.286379
2013-01-03 -0.358542 -0.355383
2013-01-04 -0.294955  0.006319

Reduction in the dimensions of the returned object

In [97]:
df.loc['20130102',['A','B']] = 1
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

For getting a scalar value

In [98]:
df.loc[dates[0],'A']

np.float64(0.5584804957477871)

In [99]:
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

### Selection by Position

See more in [Selection by Position](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)

Select via the position of the passed integers

In [100]:
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04 -0.294955  0.006319  0.918337 -3.084601
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

In [101]:
df.iloc[3] = 2
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04  2.000000  2.000000  2.000000  2.000000
2013-01-05 -1.735809  0.104906  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

By integer slices, acting similar to numpy/python

In [102]:
df.iloc[3:5,0:2] = 5
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

By lists of integer position locations, similar to the numpy/python style

In [103]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.000000 -0.229315
2013-01-03 -0.358542 -0.067001
2013-01-05  5.000000  0.588369

For slicing rows explicitly

In [104]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484

For slicing columns explicitly

In [105]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.863395  1.185102
2013-01-02  1.000000 -0.229315
2013-01-03 -0.355383 -0.067001
2013-01-04  5.000000  2.000000
2013-01-05  5.000000  0.588369
2013-01-06  1.555375 -0.497573

For getting a value explicitly

In [106]:
df.iloc[1,1]

np.float64(1.0)

For getting fast access to a scalar (equiv to the prior method)

In [107]:
df.iat[1,1]

np.float64(1.0)

### Multi Indexing

In [108]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [109]:
df2.loc[:1,'F'] = 'bar'
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  bar
1  1.0 2013-01-02  1.0  3  train  bar
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [110]:
df2.set_index(['E', 'F'], inplace=True)
df2.sort_index(inplace=True)
df2

             A          B    C  D
E     F
test  bar  1.0 2013-01-02  1.0  3
      foo  1.0 2013-01-02  1.0  3
train bar  1.0 2013-01-02  1.0  3
      foo  1.0 2013-01-02  1.0  3

### slicing through multi-indexed dataframe

In [111]:
df2.iloc[1:5,:]

             A          B    C  D
E     F
test  foo  1.0 2013-01-02  1.0  3
train bar  1.0 2013-01-02  1.0  3
      foo  1.0 2013-01-02  1.0  3

### Using loc on multi-indexed dataframe

In [113]:
ix = pd.IndexSlice

df2.loc[ix[:,'bar'],:]

             A          B    C  D
E     F
test  bar  1.0 2013-01-02  1.0  3
train bar  1.0 2013-01-02  1.0  3

## Boolean Indexing

Using a single column’s values to select data.

In [114]:
df

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

In [115]:
df[df.B > 0]

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

A where operation for getting.

In [116]:
df[df > 0]

                  A         B         C         D
2013-01-01  0.55848  0.863395  1.185102  2.349155
2013-01-02  1.00000  1.000000       NaN  0.576123
2013-01-03      NaN       NaN       NaN  0.351484
2013-01-04  5.00000  5.000000  2.000000  2.000000
2013-01-05  5.00000  5.000000  0.588369  1.372278
2013-01-06      NaN  1.555375       NaN       NaN

Using the isin() method for filtering:

In [119]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01  0.558480  0.863395  1.185102  2.349155
2013-01-02  1.000000  1.000000 -0.229315  0.576123
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.588369  1.372278
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790

In [120]:
df2['E'] = ['one','one', 'two','three','four','three']

In [121]:
df2

                   A         B         C         D      E
2013-01-01  0.558480  0.863395  1.185102  2.349155    one
2013-01-02  1.000000  1.000000 -0.229315  0.576123    one
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484    two
2013-01-04  5.000000  5.000000  2.000000  2.000000  three
2013-01-05  5.000000  5.000000  0.588369  1.372278   four
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790  three

In [122]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484   two
2013-01-05  5.000000  5.000000  0.588369  1.372278  four

## Setting

Setting a new column automatically aligns the data by the indexes

In [123]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))

In [124]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [126]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.558480  0.863395  1.185102  2.349155  NaN
2013-01-02  1.000000  1.000000 -0.229315  0.576123  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484  2.0
2013-01-04  5.000000  5.000000  2.000000  2.000000  3.0
2013-01-05  5.000000  5.000000  0.588369  1.372278  4.0
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790  5.0

Setting values by label

In [129]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.863395  1.185102  2.349155  NaN
2013-01-02  1.000000  1.000000 -0.229315  0.576123  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484  2.0
2013-01-04  5.000000  5.000000  2.000000  2.000000  3.0
2013-01-05  5.000000  5.000000  0.588369  1.372278  4.0
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790  5.0

Settomg values by position

In [131]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.185102  2.349155  NaN
2013-01-02  1.000000  1.000000 -0.229315  0.576123  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  0.351484  2.0
2013-01-04  5.000000  5.000000  2.000000  2.000000  3.0
2013-01-05  5.000000  5.000000  0.588369  1.372278  4.0
2013-01-06 -0.364734  1.555375 -0.497573 -0.281790  5.0

Setting by assigning with a numpy array

In [132]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

The result of the prior setting operations

In [133]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

A where operation with setting.

In [135]:
df2 = df.copy()
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

In [136]:
df2[df2 > 0] = -df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -1.185102 -5.0  NaN
2013-01-02 -1.000000 -1.000000 -0.229315 -5.0 -1.0
2013-01-03 -0.358542 -0.355383 -0.067001 -5.0 -2.0
2013-01-04 -5.000000 -5.000000 -2.000000 -5.0 -3.0
2013-01-05 -5.000000 -5.000000 -0.588369 -5.0 -4.0
2013-01-06 -0.364734 -1.555375 -0.497573 -5.0 -5.0

## Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [138]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

In [155]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0 NaN
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0 NaN
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0 NaN

In [142]:
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN  1.0
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0  NaN
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0  NaN

In [148]:
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0 NaN
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0 NaN
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0 NaN

To drop any rows that have missing data.

In [151]:
df1.dropna(how='all', axis=1)

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0

Filling missing data

In [152]:
df1

                   A         B         C    D    F   E
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0 NaN
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0 NaN
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0 NaN

In [154]:
df1 = df1.fillna(value=5)
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000  1.185102  5.0  5.0  5.0
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0  5.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0  5.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0  5.0

To get the boolean mask where values are nan

In [161]:
pd.isnull(df1).sum(axis=1)

2013-01-01    2
2013-01-02    1
2013-01-03    1
2013-01-04    1
Freq: D, dtype: int64

## Operations

See the [Basic section on Binary Ops](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

In [163]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [164]:
df.max()

A    5.0
B    5.0
C    2.0
D    5.0
F    5.0
dtype: float64

Same operation on the other axis

In [166]:
df.mean(axis=1)

2013-01-01    1.546275
2013-01-02    1.554137
2013-01-03    1.243815
2013-01-04    4.000000
2013-01-05    3.917674
2013-01-06    2.138614
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [167]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates)#.shift(2)

In [168]:
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [170]:
s.shift(1)

2013-01-01    NaN
2013-01-02    1.0
2013-01-03    3.0
2013-01-04    5.0
2013-01-05    NaN
2013-01-06    6.0
Freq: D, dtype: float64

In [172]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

In [171]:
df.subtract(s, axis='index')

                   A         B         C    D    F
2013-01-01 -1.000000 -1.000000  0.185102  4.0  NaN
2013-01-02 -2.000000 -2.000000 -3.229315  2.0 -2.0
2013-01-03 -5.358542 -5.355383 -5.067001  0.0 -3.0
2013-01-04       NaN       NaN       NaN  NaN  NaN
2013-01-05 -1.000000 -1.000000 -5.411631 -1.0 -2.0
2013-01-06 -8.364734 -6.444625 -8.497573 -3.0 -3.0

In [173]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01 -1.000000 -1.000000  0.185102  4.0  NaN
2013-01-02 -2.000000 -2.000000 -3.229315  2.0 -2.0
2013-01-03 -5.358542 -5.355383 -5.067001  0.0 -3.0
2013-01-04       NaN       NaN       NaN  NaN  NaN
2013-01-05 -1.000000 -1.000000 -5.411631 -1.0 -2.0
2013-01-06 -8.364734 -6.444625 -8.497573 -3.0 -3.0

### Apply

Applying functions to the data

In [174]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

In [177]:
df.cumsum()

                    A          B         C     D     F
2013-01-01   0.000000   0.000000  1.185102   5.0   NaN
2013-01-02   1.000000   1.000000  0.955787  10.0   1.0
2013-01-03   0.641458   0.644617  0.888786  15.0   3.0
2013-01-04   5.641458   5.644617  2.888786  20.0   6.0
2013-01-05  10.641458  10.644617  3.477155  25.0  10.0
2013-01-06  10.276724  12.199993  2.979581  30.0  15.0

In [180]:
df.apply(np.cumsum)

                    A          B         C     D     F
2013-01-01   0.000000   0.000000  1.185102   5.0   NaN
2013-01-02   1.000000   1.000000  0.955787  10.0   1.0
2013-01-03   0.641458   0.644617  0.888786  15.0   3.0
2013-01-04   5.641458   5.644617  2.888786  20.0   6.0
2013-01-05  10.641458  10.644617  3.477155  25.0  10.0
2013-01-06  10.276724  12.199993  2.979581  30.0  15.0

In [182]:
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  1.185102  5.0  NaN
2013-01-02  1.000000  1.000000 -0.229315  5.0  1.0
2013-01-03 -0.358542 -0.355383 -0.067001  5.0  2.0
2013-01-04  5.000000  5.000000  2.000000  5.0  3.0
2013-01-05  5.000000  5.000000  0.588369  5.0  4.0
2013-01-06 -0.364734  1.555375 -0.497573  5.0  5.0

In [183]:
df.apply(lambda x: x.max() - x.min(), axis=1)

2013-01-01    5.000000
2013-01-02    5.229315
2013-01-03    5.358542
2013-01-04    3.000000
2013-01-05    4.411631
2013-01-06    5.497573
Freq: D, dtype: float64

### Histogramming

See more at [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [184]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [185]:
s

0    1
1    5
2    4
3    5
4    3
5    3
6    4
7    0
8    6
9    2
dtype: int64

In [186]:
s.value_counts()

5    2
4    2
3    2
1    1
0    1
6    1
2    1
Name: count, dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [187]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [188]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: str

In [189]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: str

## Merge

### Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with concat():

In [190]:
df = pd.DataFrame(np.random.randn(10, 4))

In [191]:
df

          0         1         2         3
0  1.200995  2.048899 -1.741123 -0.427735
1  0.700132 -1.109827 -0.900336  0.202431
2 -1.849280  0.751738  0.272343  0.890525
3 -0.010421  1.121221  1.676275  0.012746
4  0.767540  0.523605 -0.194881  1.571361
5  0.443993  1.099494 -0.272406 -0.189431
6  0.247823 -0.201347  1.322933 -2.046874
7  0.635649 -1.185583 -1.070426 -0.483053
8  0.209484 -0.239818 -1.022772 -0.778014
9  0.347978  1.613065 -0.149587  0.901365

In [192]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  1.200995  2.048899 -1.741123 -0.427735
 1  0.700132 -1.109827 -0.900336  0.202431
 2 -1.849280  0.751738  0.272343  0.890525,
           0         1         2         3
 3 -0.010421  1.121221  1.676275  0.012746
 4  0.767540  0.523605 -0.194881  1.571361
 5  0.443993  1.099494 -0.272406 -0.189431
 6  0.247823 -0.201347  1.322933 -2.046874,
           0         1         2         3
 7  0.635649 -1.185583 -1.070426 -0.483053
 8  0.209484 -0.239818 -1.022772 -0.778014
 9  0.347978  1.613065 -0.149587  0.901365]

In [193]:
pd.concat(pieces)

          0         1         2         3
0  1.200995  2.048899 -1.741123 -0.427735
1  0.700132 -1.109827 -0.900336  0.202431
2 -1.849280  0.751738  0.272343  0.890525
3 -0.010421  1.121221  1.676275  0.012746
4  0.767540  0.523605 -0.194881  1.571361
5  0.443993  1.099494 -0.272406 -0.189431
6  0.247823 -0.201347  1.322933 -2.046874
7  0.635649 -1.185583 -1.070426 -0.483053
8  0.209484 -0.239818 -1.022772 -0.778014
9  0.347978  1.613065 -0.149587  0.901365

### Join

SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [200]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [201]:
right = pd.DataFrame({'key': ['foo', 'bah'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bah     5

In [205]:
pd.merge(left, right, on='key', how='outer')

   key  lval  rval
0  bah   NaN   5.0
1  bar   2.0   NaN
2  foo   1.0   4.0

### Append

Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [206]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [207]:
df

          A         B         C         D
0  0.128202 -0.266027 -0.315476  1.288523
1  0.410634  0.550474 -0.995326  0.079052
2  2.230548  1.088229 -1.666740  1.040301
3 -0.071123  2.540147  0.025697  0.284285
4 -0.188029  0.926822 -0.028452  0.128850
5 -0.175392  0.609868 -1.515990 -0.468709
6  0.058263 -0.336982  0.092620 -0.797268
7  0.383426 -0.367014  0.510464 -1.278034

In [ ]:
s = df.iloc[3]
s

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

* **Splitting** the data into groups based on some criteria
* **Applying** a function to each group independently
* **Combining** the results into a data structure

See the [Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                                    'C' : np.random.randn(8),
                                     'D' : np.random.randn(8)})
df

In [ ]:
df.set_index(['A', 'B']).sort_index()

Grouping and then applying a function sum to the resulting groups.

In [ ]:
df.groupby(['A', 'B']).max()

In [ ]:
df.groupby('A').sum()

In [ ]:
df.groupby(['A','B']).sum()

In [ ]:
df.set_index(['A', 'B']).sort_index()

In [ ]:
df.groupby(['A', 'B']).describe()

## Reshaping

See the sections on [Hierarchical Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [ ]:
tuples = list(zip(
    *[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
      ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

In [ ]:
df2 = df[:4]

In [ ]:
df2

The stack() method “compresses” a level in the DataFrame’s columns.

In [ ]:
stacked = df2.stack()

In [ ]:
stacked

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the **last level**:

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

### Pivot Tables

See the section on [Pivot Tables](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                                    'B' : ['A', 'B', 'C'] * 4,
                                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                                    'D' : np.random.randn(12),
                                    'E' : np.random.randn(12)})

In [ ]:
df

We can produce pivot tables from this data very easily:

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

## Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [ ]:
# pd.date_range?

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='1s')
rng

In [ ]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

In [ ]:
# ts.resample?

In [ ]:
ts.resample('1Min').sum()

Time zone representation

In [ ]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [ ]:
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')

In [ ]:
ts_utc


Convert to another time zone

In [ ]:
ts_utc.tz_convert('US/Eastern')


Converting between time span representations

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='ME')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [ ]:
ts

In [ ]:
ps = ts.to_period()

In [ ]:
ps

In [ ]:
ps.to_timestamp()

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

In [ ]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

## Plotting
[Plotting](http://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization) docs.

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [ ]:
ts = ts.cumsum()

In [ ]:
ts.plot()

On DataFrame, plot() is a convenience to plot all of the columns with labels:

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])

In [ ]:
df = df.cumsum()

In [ ]:
plt.figure(); df.plot(); plt.legend(loc='best')

## Getting Data In/Out

### CSV
[Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [ ]:
df.to_csv('foo.csv')

[Reading from a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [ ]:
pd.read_csv('foo.csv')

#### Reading large CSV files

In [ ]:
iterator = pd.read_csv('foo.csv', iterator=True, chunksize=3)
iterator

In [ ]:
iterator.get_chunk()